src_ext/DataProcessors/УЗ_Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>УЗ_Календарь</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/DataProcessors/УЗ_Календарь/Forms/ФормаКалендарь/Ext/Form/Module.bsl
&НаКлиенте
Перем РасписаниеТолькоДляПросмотра;

&НаСервере
Процедура ЗаполнитьНаСервере(ДатаНачала,ДатаОкончания)
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(ДатаНачала, ДатаОкончания);
	Планировщик.ОтображатьТекущуюДату = Истина;
	//палитра (docs\визуал\дизайнер.md): линии дней и рамка — серые, как сетка времени; текст — тёмный
	Планировщик.ЦветЛиний = УЗ_ОбщийКлиентСервер.ЦветЛинийСетки();
	Планировщик.ЦветРамки = УЗ_ОбщийКлиентСервер.ЦветЛинийСетки();
	Планировщик.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветТекстаНаЗаливке();
	       
	Элементы.Календарь.ВыделенныеДаты.Очистить();
	Если НачалоДня(ДатаНачала) <> НачалоДня(ДатаОкончания) Тогда
		Элементы.Календарь.ВыделенныеДаты.Добавить(ДатаНачала);
		СледДата = ДатаНачала;
		Пока Истина Цикл
			СледДата = КонецДня(СледДата)+1;
			Если СледДата <= НачалоДня(ДатаОкончания) Тогда
				Элементы.Календарь.ВыделенныеДаты.Добавить(СледДата);
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Элементы.Календарь.ВыделенныеДаты.Добавить(ДатаНачала);
	КонецЕсли;
	
	//уроки, помещения, график педагога, напоминания и дни с уроками — один серверный вызов, один пакетный запрос
	Итог = Обработки.УЗ_Календарь.ЗаполнитьПланировщик(Планировщик, ПараметрыКалендаря(ДатаНачала, ДатаОкончания));
	ЗагрузитьЗанятыеДаты(ЭтотОбъект, Итог.ЗанятыеДаты);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыКалендаря(ДатаНачала, ДатаОкончания)
	
	Параметры = Обработки.УЗ_Календарь.НовыеПараметры(ДатаНачала, ДатаОкончания);
	Параметры.ДатаКалендаря = Календарь;
	Параметры.ФильтрПедагог = ФильтрПедагог;
	Параметры.ФильтрПомещение = ФильтрПомещение;
	Параметры.ФильтрГруппаОбучения = ФильтрГруппаОбучения;
	Параметры.ФильтрУченик = ФильтрУченик;
	Параметры.СтатусУрока = СтатусУрока;
	Параметры.ГруппироватьПомещения = Не НеГруппироватьПомещения;
	Параметры.ОтображатьВсеПомещения = ОтображатьВсеПомещения;
	Параметры.ОтображатьНапоминания = ОтображатьНапоминания;
	Параметры.ПодписьГруппа = ГруппаОбучения;
	Параметры.ПодписьПредмет = ПредметОбучения;
	Параметры.ПодписьПедагог = Педагог;
	Параметры.ПодписьУченики = Ученики;
	Параметры.Цвет = Цвет;
	Возврат Параметры;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗагрузитьЗанятыеДаты(Форма, ЗанятыеДаты)
	
	Форма.ТЗЗанятыеДаты.Очистить();
	Для Каждого ДеньСУроками Из ЗанятыеДаты Цикл
		Форма.ТЗЗанятыеДаты.Добавить().Дата = ДеньСУроками;
	КонецЦикла;
	
КонецПроцедуры

// Границы недели (понедельник 00:00 — воскресенье 23:59:59). Свои функции вместо НачалоНедели/КонецНедели:
// в веб-клиенте на клиенте они для понедельника вернули дату без изменений и «+7 дней», и неделя в планировщике
// растягивалась до 8–15 колонок со шкалой, сдвинутой на текущее время (проверено 28.09.2026, 8.3.27).
&НаКлиентеНаСервереБезКонтекста
Функция НачалоНеделиДаты(Знач Момент)

	Возврат НачалоДня(Момент) - (ДеньНедели(Момент) - 1) * 86400;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КонецНеделиДаты(Знач Момент)

	Возврат НачалоНеделиДаты(Момент) + 7 * 86400 - 1;

КонецФункции

//&НаКлиенте
//Процедура ПланировщикПриАктивизации(Элемент, СтандартнаяОбработка)
	
	//Если НЕ Элементы.Планировщик.ТолькоПросмотр Тогда 
	//	СтандартнаяОбработка = Ложь;
	//	
	//	//Если ТипЗнч(Элемент.ВыделенныеЭлементы[0].Значение) = Тип("ДокументСсылка.Урок") Тогда
	//	Если Элемент.ВыделенныеЭлементы.Количество() > 0 Тогда
	//		ПоказатьЗначение(,Элемент.ВыделенныеЭлементы[0].Значение);
	//	КонецЕсли;
	//КонецЕсли;
	//Пар = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	//ОткрытьФорму("Документ.Урок.Форма.ФормаДокумента", Пар,ЭтотОбъект,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);				
	//Иначе		
	//Попытка
	//КлючНапоминания = Элементы.Планировщик.ВыделенныеЭлементы[0].Значение;
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Ключ",КлючНапоминания);
	//ОткрытьФорму("РегистрСведений.НапоминанияПользователя.Форма.Напоминание", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	//ПоказатьЗначение(,Элемент.ВыделенныеЭлементы[0].Значение);
	//Исключение
	//КонецПопытки; 		
	//КонецЕсли;	
	
//КонецПроцедуры

#Region Календарь

&НаКлиенте
Процедура КалендарьПриАктивизацииДаты(Элемент)
	
	СтарыйМассив = Элементы.Календарь.ВыделенныеДаты;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(СтарыйМассив);
	СписокЗначений.СортироватьПоЗначению();
	НовыйМассив = СписокЗначений.ВыгрузитьЗначения(); 
	
	Если КалендарьПоследняяДата.Количество() = 0 Или КалендарьПоследняяДата[0].Значение <> Календарь Тогда 
		КалендарьПоследняяДата.Вставить(0,Календарь);
	КонецЕсли;
	Пока КалендарьПоследняяДата.Количество() > 2 Цикл
		КалендарьПоследняяДата.Удалить(2);
	КонецЦикла;
	
	НачалоПериода = НовыйМассив[0];
	КонецПериода = КонецДня(НовыйМассив[НовыйМассив.Количество()-1]);
	
	Если Переключатель = "День" Тогда
		ДатаНачала = НачалоДня(НачалоПериода);
		ДатаОкончания = КонецДня(КонецПериода);
	ИначеЕсли Переключатель = "Неделя" Тогда
		ДатаНачала = НачалоНеделиДаты(НачалоПериода);
		ДатаОкончания = КонецНеделиДаты(КонецПериода);
	ИначеЕсли Переключатель = "Месяц" Тогда
		ДатаНачала = НачалоМесяца(НачалоПериода);
		ДатаОкончания = КонецМесяца(КонецПериода);
	КонецЕсли; 
	
	ЗаполнитьНаСервере(ДатаНачала,ДатаОкончания);
	Элементы.Календарь.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриВыводеПериода(Элемент, ОформлениеПериода)
	
	Для Каждого ОформлениеДаты Из ОформлениеПериода.Даты Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("Дата",ОформлениеДаты.Дата);
		Если ТЗЗанятыеДаты.НайтиСтроки(Отбор).Количество()>0 Тогда //ТЗЗанятыеДаты.НайтиПоЗначению(ОформлениеДаты.Дата) <> Неопределено 
			//дни с уроками — жирным, без цветной заливки (цвет в продукте несёт смысл)
			ОформлениеДаты.Шрифт = Новый Шрифт(, , Истина);
		КонецЕсли;
		
		//Подсвечиваем текущий день
		//Если НачалоДня(ОформлениеДаты.Дата) = НачалоДня(ТекущаяДата()) Тогда 
		//ОформлениеДаты.ЦветТекста = WebЦвета.Золотистый;
		//ОформлениеДаты.Шрифт = Новый Шрифт(,12,Истина,,Истина);
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	СформироватьСписокЗанятыхДат();
КонецПроцедуры
#EndRegion

// Дни с уроками для календаря слева — без контекста формы (на сервер уходят только дата и отборы).
&НаКлиенте
Процедура СформироватьСписокЗанятыхДат()
	
	ЗагрузитьЗанятыеДаты(ЭтотОбъект, ЗанятыеДатыНаСервере(Календарь, ФильтрПедагог, ФильтрПомещение, ФильтрГруппаОбучения));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗанятыеДатыНаСервере(ДатаКалендаря, ФильтрПедагог, ФильтрПомещение, ФильтрГруппаОбучения)
	
	Параметры = Обработки.УЗ_Календарь.НовыеПараметры();
	Параметры.ДатаКалендаря = ДатаКалендаря;
	Параметры.ФильтрПедагог = ФильтрПедагог;
	Параметры.ФильтрПомещение = ФильтрПомещение;
	Параметры.ФильтрГруппаОбучения = ФильтрГруппаОбучения;
	Возврат Обработки.УЗ_Календарь.ЗанятыеДаты(Параметры);
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ПоложениеШкалыВремениТекст) Тогда
		ПоложениеШкалыВремениТекст = "Лево"; 	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВремяКалендаряС) или Не ЗначениеЗаполнено(ВремяКалендаряПо) Тогда
		ВремяКалендаряС = 8;  // 8 с 8:00 (00:00 + 8 часов = 8:00)
		ВремяКалендаряПо = 20; // 4 до 20:00 (00:00 - 4 часа = 20:00)
	КонецЕсли;
		
	//Если Переключатель = "День" Тогда 
	//	Элементы.Календарь.НачалоПериодаОтображения = НачалоДня(ТекущаяДата());		
	//	Элементы.Календарь.КонецПериодаОтображения = КонецДня(ТекущаяДата());
	//ИначеЕсли Переключатель = "Неделя" Тогда 
	//	Элементы.Календарь.НачалоПериодаОтображения = НачалоНеделиДаты(ТекущаяДата());		
	//	Элементы.Календарь.КонецПериодаОтображения = НачалоНеделиДаты(ТекущаяДата());
	//ИначеЕсли Переключатель = "Месяц" Тогда 
	//	Элементы.Календарь.НачалоПериодаОтображения = НачалоМесяца(ТекущаяДата());		
	//	Элементы.Календарь.КонецПериодаОтображения = НачалоМесяца(ТекущаяДата());
	//КонецЕсли; 
	//в веб-клиенте расписание мышью не меняется (создание, перенос, растягивание отменяются в обработчиках),
	//но поле не «Только просмотр»: платформа рисует такое поле блёклым текстом, а урок в нём не открывается
	#Если ВебКлиент Тогда
		РасписаниеТолькоДляПросмотра = Истина;
	#КонецЕсли

	ЗаполнитьНаКлиенте(Неопределено, Неопределено);
	ОбновитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаКлиенте(ДатаНач = Неопределено, ДатаОконч = Неопределено)

	//дни с уроками заполняет тот же серверный вызов ЗаполнитьНаСервере (прежде — ещё два вызова с формой)
	Элементы.Календарь.ВыделенныеДаты.Очистить();	
	Если ДатаНач <> Неопределено Тогда 
		ДатаНачала = ДатаНач;
		ДатаОкончания = ДатаОконч;
	ИначеЕсли Календарь = '00010101' Тогда
		ДатаНачала = ТекущаяДата();
		ДатаОкончания = ТекущаяДата();
	Иначе
		ДатаНачала = Календарь;
		ДатаОкончания = Календарь;
		Элементы.Календарь.ВыделенныеДаты.Добавить(Календарь);
	КонецЕсли;
	
	Планировщик.ОтступСНачалаПереносаШкалыВремени = ВремяКалендаряС; // 8 с 8:00 (00:00 + 8 часов = 8:00)
	Планировщик.ОтступСКонцаПереносаШкалыВремени = 24-ВремяКалендаряПо;// 4 до 20:00 (00:00 - 4 часа = 20:00)
	
	Если Переключатель = "День" Тогда
		ДатаНачала = НачалоДня(ДатаНачала);
		ДатаОкончания = КонецДня(ДатаОкончания);
		Планировщик.ОтображатьТекущуюДату = Ложь;
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
		Планировщик.КратностьПериодическогоВарианта = 48;
		//Планировщик.ОтступСНачалаПереносаШкалыВремени = 8;
		//Планировщик.ОтступСКонцаПереносаШкалыВремени = 0;
		Планировщик.ОтображатьПеренесенныеЗаголовки = Истина;
		Планировщик.ОтображатьПеренесенныеЗаголовкиШкалыВремени = Ложь;
		Планировщик.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.ВремяНачалаИКонца;
		//Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='dddd, d MMMM yyyy'";
		Если ПоложениеШкалыВремениТекст = "Лево" Тогда
			Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Лево;
		ИначеЕсли ПоложениеШкалыВремениТекст = "Верх" Тогда
			Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Верх;
		ИначеЕсли ПоложениеШкалыВремениТекст = "Низ" Тогда
			Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Низ;
		ИначеЕсли ПоложениеШкалыВремениТекст = "Право" Тогда
			Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Право;
		КонецЕсли; 
		Планировщик.ШкалаВремени.Элементы[0].Формат = "ДФ=ЧЧ:мм";
		Планировщик.ШкалаВремени.Элементы[0].Кратность = 30;
		Планировщик.ШкалаВремени.Элементы[0].Единица = ТипЕдиницыШкалыВремени.Минута; 		
	ИначеЕсли Переключатель = "Неделя" Тогда
		ДатаНачала = НачалоНеделиДаты(ДатаНачала);
		ДатаОкончания = КонецНеделиДаты(ДатаОкончания);
		Планировщик.ОтображатьТекущуюДату = Ложь;
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
		Планировщик.КратностьПериодическогоВарианта = 24;
		//Планировщик.ОтступСНачалаПереносаШкалыВремени = 8;
		//Планировщик.ОтступСКонцаПереносаШкалыВремени = 0;
		Планировщик.ОтображатьПеренесенныеЗаголовки = Истина;
		Планировщик.ОтображатьПеренесенныеЗаголовкиШкалыВремени = Ложь;
		Планировщик.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.НеОтображать;
		//Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='ddd, d MMMM'";
		Если ПоложениеШкалыВремениТекст = "Лево" Тогда
			Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Лево;
		ИначеЕсли ПоложениеШкалыВремениТекст = "Верх" Тогда
			Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Верх;
		ИначеЕсли ПоложениеШкалыВремениТекст = "Низ" Тогда
			Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Низ;
		ИначеЕсли ПоложениеШкалыВремениТекст = "Право" Тогда
			Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Право;
		КонецЕсли; 
		Планировщик.ШкалаВремени.Элементы[0].Формат = "ДФ=ЧЧ:мм";
		Планировщик.ШкалаВремени.Элементы[0].Кратность = 30;
		Планировщик.ШкалаВремени.Элементы[0].Единица = ТипЕдиницыШкалыВремени.Минута;
	ИначеЕсли Переключатель = "Месяц" Тогда
		ДатаНачала = НачалоМесяца(ДатаНачала);
		ДатаОкончания = КонецМесяца(ДатаОкончания);
		
		Планировщик.ОтображатьТекущуюДату = Ложь;
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.День;
		Планировщик.КратностьПериодическогоВарианта = 7;
		Планировщик.ОтступСНачалаПереносаШкалыВремени = 0;
		Планировщик.ОтступСКонцаПереносаШкалыВремени = 0;
		Планировщик.ОтображатьПеренесенныеЗаголовки = Ложь;
		Планировщик.ОтображатьПеренесенныеЗаголовкиШкалыВремени = Истина;
		Планировщик.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.НеОтображать;
		//Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='ddd, d MMM yyyy'";
		Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Лево;
		Планировщик.ШкалаВремени.Элементы[0].Формат = "ДФ='ddd, d MMM yyyy'";
		Планировщик.ШкалаВремени.Элементы[0].Кратность = 1;
		Планировщик.ШкалаВремени.Элементы[0].Единица = ТипЕдиницыШкалыВремени.День;
		
		Интервал = Планировщик.ИнтервалыФона.Добавить(НачалоМесяца(ДатаНачала), КонецМесяца(ДатаОкончания));
		Интервал.Цвет = Новый Цвет(250, 250, 250);
		//Если НастройкиОтображения.ОтображатьТекущуюДату Тогда
		//	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		//	Интервал = Планировщик.ИнтервалыФона.Добавить(НачалоДня(ТекущаяДатаСеанса), КонецДня(ТекущаяДатаСеанса));
		//	Интервал.Цвет = Новый Цвет(223, 255, 223);
		//КонецЕсли; 
		
	КонецЕсли;   
	
	ЗаполнитьНаСервере(ДатаНачала,ДатаОкончания);
	
	Элементы.Календарь.Обновить();
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='dd MMMM yyy (дддд)'";
	Переключатель = "День";
	Цвет		  = "ПредмОбуч";
	СкрытьНастройки = Истина;
	
	//Если НЕ РольДоступна("ПолныеПрава") Тогда 
	//	Элементы.Планировщик.ТолькоПросмотр = Истина;
	//КонецЕсли;  
	     	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	Если Переключатель = "День" Тогда
		ЗаполнитьНаКлиенте(Планировщик.ТекущиеПериодыОтображения[0].Начало, КонецДня(Планировщик.ТекущиеПериодыОтображения[0].Начало));
	ИначеЕсли Переключатель = "Месяц" Тогда
		ЗаполнитьНаКлиенте(НачалоМесяца(Планировщик.ТекущиеПериодыОтображения[0].Начало), КонецМесяца(Планировщик.ТекущиеПериодыОтображения[0].Начало));
	ИначеЕсли Переключатель = "Неделя" Тогда
		Если ТекущаяДата()>=Планировщик.ТекущиеПериодыОтображения[0].Начало и ТекущаяДата()<=Планировщик.ТекущиеПериодыОтображения[0].Конец Тогда
			ЗаполнитьНаКлиенте(НачалоНеделиДаты(ТекущаяДата()), КонецНеделиДаты(ТекущаяДата()));
		Иначе
			ЗаполнитьНаКлиенте(НачалоНеделиДаты(Планировщик.ТекущиеПериодыОтображения[0].Начало), КонецНеделиДаты(Планировщик.ТекущиеПериодыОтображения[0].Начало));
		КонецЕсли;
	Иначе 		
		ЗаполнитьНаКлиенте(Планировщик.ТекущиеПериодыОтображения[0].Начало, Планировщик.ТекущиеПериодыОтображения[0].Конец);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Цвет1ПриИзменении(Элемент)
	ЗаполнитьНаКлиенте(Планировщик.ТекущиеПериодыОтображения[0].Начало, Планировщик.ТекущиеПериодыОтображения[0].Конец);
КонецПроцедуры




////////////////Управление периодами планировщика//////////////////////////////////
&НаКлиенте
Процедура ПредыдущийПериод(Команда)
	
	НачалоПериода = НачалоДня(Планировщик.ТекущиеПериодыОтображения[0].Начало);
	//КонецПериода = ТекущиеПериодыОтображения[0].Начало;
	
	Если Переключатель = "День" Тогда
		ДатаНачала = НачалоДня(НачалоПериода-1);
		ДатаОкончания = КонецДня(НачалоПериода-1);
	ИначеЕсли Переключатель = "Неделя" Тогда
		ДатаНачала = НачалоНеделиДаты(НачалоПериода-1);
		ДатаОкончания = КонецНеделиДаты(НачалоПериода-1);
	ИначеЕсли Переключатель = "Месяц" Тогда
		ДатаНачала = НачалоМесяца(НачалоПериода-1);
		ДатаОкончания = КонецМесяца(НачалоПериода-1);
	КонецЕсли; 
	
	ЗаполнитьНаСервере(ДатаНачала,ДатаОкончания);
	Элементы.Календарь.Обновить();	
	
КонецПроцедуры

&НаКлиенте
Процедура БудущийПериод(Команда)
	
	НачалоПериода = КонецДня(Планировщик.ТекущиеПериодыОтображения[0].Конец);
	
	Если Переключатель = "День" Тогда
		ДатаНачала = НачалоДня(НачалоПериода+1);
		ДатаОкончания = КонецДня(НачалоПериода+1);
	ИначеЕсли Переключатель = "Неделя" Тогда
		ДатаНачала = НачалоНеделиДаты(НачалоПериода+1);
		ДатаОкончания = КонецНеделиДаты(НачалоПериода+1);
	ИначеЕсли Переключатель = "Месяц" Тогда
		ДатаНачала = НачалоМесяца(НачалоПериода+1);
		ДатаОкончания = КонецМесяца(НачалоПериода+1);
	КонецЕсли; 
	
	ЗаполнитьНаСервере(ДатаНачала,ДатаОкончания);
	Элементы.Календарь.Обновить();		
	
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	
	НачалоПериода = НачалоДня(ТекущаяДата());
	
	Если Переключатель = "День" Тогда
		ДатаНачала = НачалоДня(НачалоПериода);
		ДатаОкончания = КонецДня(НачалоПериода);
	ИначеЕсли Переключатель = "Неделя" Тогда
		ДатаНачала = НачалоНеделиДаты(НачалоПериода);
		ДатаОкончания = КонецНеделиДаты(НачалоПериода);
	ИначеЕсли Переключатель = "Месяц" Тогда
		ДатаНачала = НачалоМесяца(НачалоПериода);
		ДатаОкончания = КонецМесяца(НачалоПериода);
	КонецЕсли; 
	
	ЗаполнитьНаСервере(ДатаНачала,ДатаОкончания);
	Элементы.Календарь.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	Если СкрытьНастройки Тогда
		Элементы.Группа3.Видимость = Ложь;
	Иначе
		Элементы.Группа3.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры



#Region КомандыПланировщика

&НаКлиенте
Процедура ПланировщикПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если РасписаниеТолькоДляПросмотра = Истина Тогда
		Возврат;
	КонецЕсли;

	Если Значения.Количество() = 1 Тогда
		Пом = Значения.Получить("Помещение");
	Иначе
		Пом = ФильтрПомещение;
	КонецЕсли;
	//без вопроса «Создать новый урок?»: сразу открывается заполненный черновик — не нужен, закрыть без записи
	ОткрытьНовыйУрок(Начало, Конец, Пом);

КонецПроцедуры

//Реквизиты нового урока из отбора календаря: группа (её педагог со ставкой, предмет, тариф) или педагог.
&НаСервереБезКонтекста
Функция ЗначенияНовогоУрока(ГруппаОбучения, Педагог)

	Значения = Новый Структура;
	Если ЗначениеЗаполнено(ГруппаОбучения) Тогда
		Значения.Вставить("ГруппаОбучения", ГруппаОбучения);
		Значения.Вставить("Педагог", ГруппаОбучения.Педагог);
		Значения.Вставить("СтавкаПедагога", Документы.УЗ_Урок.СтавкаПедагогаПоУмолчанию(ГруппаОбучения.Педагог, ГруппаОбучения));
		Значения.Вставить("ПредметОбучения", ГруппаОбучения.ПредметОбучения);
		Если ЗначениеЗаполнено(ГруппаОбучения.Тариф) Тогда
			Значения.Вставить("Тариф", ГруппаОбучения.Тариф);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Педагог) Тогда
		Значения.Вставить("Педагог", Педагог);
		Значения.Вставить("СтавкаПедагога", Педагог.СтавкаПедагога);
	КонецЕсли;
	Возврат Значения;

КонецФункции

&НаКлиенте
Процедура ОткрытьНовыйУрок(Начало, Конец, Пом)

	Форма = ПолучитьФорму("Документ.УЗ_Урок.Форма.ФормаДокумента", , ЭтотОбъект);
	Форма.Объект.Дата = Начало;
	Форма.Объект.КоличествоЧасов = (Конец - Начало) / 3600;
	
	//реквизиты группы и педагога — с сервера (на клиенте реквизиты ссылок недоступны); тариф группы тоже
	//(прежде урок из календаря шёл без тарифа — ученики «К оплате» без тарифа)
	ЗначенияУрока = ЗначенияНовогоУрока(ФильтрГруппаОбучения, ФильтрПедагог);
	ЗаполнитьЗначенияСвойств(Форма.Объект, ЗначенияУрока);
	Форма.Объект.Помещение = Пом;
	//календарь перечитывается, когда черновик закрыт (записан или нет), а не сразу после открытия
	Форма.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияУрока", ЭтотОбъект);
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияУрока(Результат, ДополнительныеПараметры) Экспорт

	ЗаполнитьНаКлиенте(Планировщик.ТекущиеПериодыОтображения[0].Начало, Планировщик.ТекущиеПериодыОтображения[0].Конец);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)

	Если РасписаниеТолькоДляПросмотра = Истина Тогда
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли;
	Действие = ДействиеСДокументом();
	Если Действие = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//вместо «Да/Нет» — кнопки с названием действия: «Перенести» / «Оставить как было»
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Применить", Действие.Кнопка);
	Кнопки.Добавить("Оставить", НСтр("ru = 'Оставить как было'"));
	Оповещение = Новый ОписаниеОповещения("ПланировщикПриОкончанииРедактированияЗавершение", ЭтотОбъект, Действие);
	ПоказатьВопрос(Оповещение, Действие.Текст, Кнопки, 0, "Применить", Действие.Кнопка);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактированияЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = "Применить" Тогда
		ИзменитьДокумент(ДополнительныеПараметры);
	КонецЕсли;
	//и после отказа, и после переноса: прямоугольник урока встаёт туда, где урок записан
	ЗаполнитьНаКлиенте(Планировщик.ТекущиеПериодыОтображения[0].Начало, Планировщик.ТекущиеПериодыОтображения[0].Конец);

КонецПроцедуры

// Что сделали мышью с уроком: перенос по времени и/или смена помещения. Данные — из выделенного элемента
// планировщика на клиенте; прежние дата, окончание и помещение урока — одним вызовом без контекста формы.
&НаКлиенте
Функция ДействиеСДокументом()

	ТекДанные = Элементы.Планировщик.ВыделенныеЭлементы;
	Если ТекДанные.Количество() <> 1 Или ТипЗнч(ТекДанные[0].Значение) <> Тип("ДокументСсылка.УЗ_Урок") Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЭлементУрока = ТекДанные[0];
	ПоПомещениям = ЭлементУрока.ЗначенияИзмерений.Количество() = 1;
	ПомКуда = ?(ПоПомещениям, ЭлементУрока.ЗначенияИзмерений.Получить("Помещение"), Неопределено);
	Возврат ОписаниеИзменения(ЭлементУрока.Значение, ЭлементУрока.Начало, ЭлементУрока.Конец, ПоПомещениям, ПомКуда);

КонецФункции

&НаСервереБезКонтекста
Функция ОписаниеИзменения(Урок, Начало, Конец, ПоПомещениям, ПомКуда)

	Реквизиты = РеквизитыПереносимогоУрока(Урок);
	ПомОткуда = Реквизиты.Помещение;
	Если Не ПоПомещениям Тогда
		ПомКуда = ПомОткуда;
	КонецЕсли;
	СменаВремени = Реквизиты.Дата <> Начало Или Реквизиты.Окончание <> Конец;
	СменаПомещения = ПомОткуда <> ПомКуда;
	Если Не СменаВремени И Не СменаПомещения Тогда
		Возврат Неопределено;
	КонецЕсли;

	ФорматВремени = "ДФ='дд.ММ.гг ЧЧ:мм'";
	Строки = Новый Массив;
	Строки.Добавить(Строка(Урок));
	Если СменаВремени Тогда
		Строки.Добавить(СтрШаблон(НСтр("ru = 'Время: %1 – %2 → %3 – %4'"),
			Формат(Реквизиты.Дата, ФорматВремени), Формат(Реквизиты.Окончание, "ДФ=ЧЧ:мм"),
			Формат(Начало, ФорматВремени), Формат(Конец, "ДФ=ЧЧ:мм")));
	КонецЕсли;
	Если СменаПомещения Тогда
		Строки.Добавить(СтрШаблон(НСтр("ru = 'Помещение: %1 → %2'"),
			?(ЗначениеЗаполнено(ПомОткуда), Строка(ПомОткуда), НСтр("ru = 'без помещения'")),
			?(ЗначениеЗаполнено(ПомКуда), Строка(ПомКуда), НСтр("ru = 'без помещения'"))));
	КонецЕсли;
	Если СменаВремени И СменаПомещения Тогда
		Кнопка = НСтр("ru = 'Перенести и сменить помещение'");
	ИначеЕсли СменаВремени Тогда
		Кнопка = НСтр("ru = 'Перенести'");
	Иначе
		Кнопка = НСтр("ru = 'Сменить помещение'");
	КонецЕсли;

	Действие = Новый Структура;
	Действие.Вставить("Текст", СтрСоединить(Строки, Символы.ПС));
	Действие.Вставить("Кнопка", Кнопка);
	Действие.Вставить("Документ", Урок);
	Действие.Вставить("Дата", Начало);
	Действие.Вставить("Окончание", Конец);
	Действие.Вставить("Помещение", ПомКуда);
	Возврат Действие;

КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыПереносимогоУрока(Урок)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Урок.Дата КАК Дата,
	|	Урок.Окончание КАК Окончание,
	|	Урок.Помещение КАК Помещение
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	Урок.Ссылка = &Урок");
	Запрос.УстановитьПараметр("Урок", Урок);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Новый Структура("Дата, Окончание, Помещение", Выборка.Дата, Выборка.Окончание, Выборка.Помещение);

КонецФункции

// Перенос урока из календаря. План/факт решает сервер (УЗ_Общий.ЗаписатьУрок, дата сеанса), не часы клиента.
&НаСервереБезКонтекста
Функция ИзменитьДокумент(Действие)
	
	Об = Действие.Документ.ПолучитьОбъект();
	Об.Дата = Действие.Дата;
	Об.КоличествоЧасов = (Действие.Окончание - Действие.Дата) / 3600;
	Об.Помещение = Действие.Помещение;
	
	//проведённый урок перепроводится (раньше запись оставляла движения на старой дате); по В10 урок,
	//который ещё не начался, только записывается; отказ (пересечение, закрытый период) — понятным текстом
	Итог = УЗ_Общий.ЗаписатьУрок(Об, Об.Проведен);
	Если Не Итог.Успех Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Урок %1 не перенесён: %2'"),
			Действие.Документ, Итог.Текст));
		Возврат Ложь;
	КонецЕсли;
	Если Итог.Пометка <> "" Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Урок %1 перенесён и %2'"),
			Действие.Документ, Итог.Пометка));
	КонецЕсли;
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ПланировщикВыбор(Элемент, СтандартнаяОбработка)
	Если НЕ Элементы.Планировщик.ТолькоПросмотр Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,Элемент.ВыделенныеЭлементы[0].Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//НачалоПериода = ТекущиеПериодыОтображения[0].Начало;
	//КонецПериода = ТекущиеПериодыОтображения[0].Начало;//ТекущиеПериодыОтображения[0].Конец;
	
	//Если Переключатель = "День" Тогда
	//	ДатаНачала = НачалоДня(ТекущиеПериодыОтображения[0].Начало);
	//	ДатаОкончания = КонецДня(ТекущиеПериодыОтображения[0].Начало);
	//ИначеЕсли Переключатель = "Неделя" Тогда
	//	ДатаНачала = НачалоНеделиДаты(ТекущиеПериодыОтображения[0].Начало);
	//	ДатаОкончания = КонецНеделиДаты(ТекущиеПериодыОтображения[0].Начало);
	//ИначеЕсли Переключатель = "Месяц" Тогда
	//	ДатаНачала = НачалоМесяца(НачалоПериода);
	//	ДатаОкончания = КонецМесяца(КонецПериода);
	//КонецЕсли; 
	
	//ЗаполнитьНаСервере(ДатаНачала,ДатаОкончания);
	//Элементы.Календарь.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	
	Если НЕ Элементы.Планировщик.ТолькоПросмотр Тогда
		СтандартнаяОбработка = Ложь;       	
		ПоказатьЗначение(,Элемент.ВыделенныеЭлементы[0].Значение);
	КонецЕсли;
	
КонецПроцедуры

#EndRegion


&НаКлиенте
Процедура СкрытьНастройкиПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьНаКлиенте(Планировщик.ТекущиеПериодыОтображения[0].Начало, Планировщик.ТекущиеПериодыОтображения[0].Конец);
КонецПроцедуры

&НаКлиенте
Процедура РазделительКартинка1Нажатие(Элемент)
	Элементы.ГруппаЛево.Видимость = НЕ Элементы.ГруппаЛево.Видимость;
	Элементы.РазделительКартинка1.Видимость = Элементы.ГруппаЛево.Видимость;
	Элементы.РазделительКартинка2.Видимость = НЕ Элементы.ГруппаЛево.Видимость;
КонецПроцедуры
